index.org
#+TITLE: Econometrics 2017
#+OPTIONS: toc:2 H:2 num:1 ^:{}

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/readtheorg.css" />


This website contains the course materials for the course of
Econometrics offered at ISEM, CUEB, in the 2nd semester of the
2016-2017 academic year.

* Announcement
** [2017-05-14 Sun]
[[*Homework set #5][Homework set #5]] is assigned, which is due on May 22nd.

** [2017-04-19 Wed]
[[*Homework set #4][Homework set #4]] is assigned, which is due on May 3rd.

** [2017-04-16 Sun]

We will have a midterm exam on April 24th, Monday. The test will cover
all contents we have learned through lecture 1 to 8. A cheat sheet is
allowed to bring in the exam. The following is a sample midterm test
to help you prepare the midterm, [[file:assignment/midterm/A%20Sample%20Mid.pdf][a sample midterm]].


** [2017-04-10 Mon]

- [[*Homework set #3][Homework set #3]] is assigned, due on *April 17th*.


** [2017-03-22 Wed]

- [[*Homework set #2][Homework set #2]] is assigned, due on *April 5th*.


** [2017-03-20 Mon]

You can download the following files, [[file:handouts/lecture_notes/r_docs/Reference%20Card.pdf][Rreferencecard.pdf]] and
[[file:handouts/lecture_notes/r_docs/r-cheat-sheet-3.pdf][Rcheatsheet.pdf]], which can help you quickly find relevant R commands.


** [2017-03-06 Mon]

- I create a survey, https://www.diaochapai.com/survey2500285, to
  inquire your understanding of probability and statistics and ask for
  your suggestion to this course. Please complete the survey in your
  spare time. Thanks!

- [[*Homework set #1][Homework set #1]] is assigned, due on *March 13*.


* Syllabus

Read carefully the syllabus ([[file:handouts/syllabus/syllabus_econometrics_2017_web.org][html]] or [[file:handouts/syllabus/syllabus_econometrics_2017.pdf][pdf]]).


* Lecture notes

** Lecture 1: What is Econometrics?
- The lecture notes ([[file:handouts/lecture_notes/lecture_1/lecture_1.html][html]] or [[file:handouts/lecture_notes/lecture_1/lecture_1.pdf][pdf]])
- The slides ([[file:handouts/lecture_notes/lecture_1/slides_lecture_1.html][html]] or [[file:handouts/lecture_notes/lecture_1/slides_lecture_1_beamer.pdf][pdf]])

** Lecture 2: Review of Probability
- The lecture notes ([[file:handouts/lecture_notes/lecture_2/lecture_2.html][html]] or [[file:handouts/lecture_notes/lecture_2/lecture_2.pdf][pdf]])
- The slides ([[file:handouts/lecture_notes/lecture_2/slides_lecture_2.html][html]] or [[file:handouts/lecture_notes/lecture_2/slides_lecture_2_bearmer.pdf][pdf]])

** Lecture 3: Review of Statistics
- The lecture notes ([[file:handouts/lecture_notes/lecture_3/lecture_3.html][html]] or [[file:handouts/lecture_notes/lecture_3/lecture_3.pdf][pdf]])
- The slides ([[file:handouts/lecture_notes/lecture_3/slide_lecture_3.html][html]] or [[file:handouts/lecture_notes/lecture_3/slide_lecture_3_beamer.pdf][pdf]])

** Lecture 4: Review of Linear Algebra
- The lecture notes ([[file:handouts/lecture_notes/lecture_4/lecture_4.html][html]] or [[file:handouts/lecture_notes/lecture_4/lecture_4.pdf][pdf]])
- The slides ([[file:handouts/lecture_notes/lecture_4/slides_lecture_4.html][html]] or [[file:handouts/lecture_notes/lecture_4/slides_lecture_4_beamer.pdf][pdf]])
** Lecture 5: Introduction to R

- The lecture notes ([[file:handouts/lecture_notes/lecture_5/lecture_5.html][html]] or [[file:handouts/lecture_notes/lecture_5/lecture_5.pdf][pdf]])
- The R file that contains all the code in the lecture notes ([[file:handouts/lecture_notes/lecture_5/lecture_5.R][R
  file]]).
- The whole package that can generate a complete an answer to
  Empirical exercise 3.1, [[file:handouts/lecture_notes/lecture_5/rfiles.zip][rfiles.zip]].
- I also upload a file as a tutorial for Econometrics with R
  ([[file:handouts/lecture_notes/lecture_5/Farnsworth-EconometricsInR.pdf][pdf]]).

** Lecture 6: Linear Regression with One Regressor
- The lecture notes ([[file:handouts/lecture_notes/lecture_6/lecture_6.html][html]] or [[file:handouts/lecture_notes/lecture_6/lecture_6.pdf][pdf]])
- The slides ([[file:handouts/lecture_notes/lecture_6/slides_lecture_6.html][html]] or [[file:handouts/lecture_notes/lecture_6/slides_lecture_6_beamer.pdf][pdf]])
- The R demonstration ([[file:handouts/lecture_notes/lecture_6/replication/replicate_ch4.html][html]] or [[file:handouts/lecture_notes/lecture_6/replication/replicate_ch4.pdf][pdf]])
- The R replication package ([[file:handouts/lecture_notes/lecture_6/replication/replicate_ch4_rmd/replicate_ch4_rmd.zip][the zip file]])
- The R Markdown tutorial ([[file:handouts/lecture_notes/r_docs/rmarkdown_tutorial/rmarkdown_tutorial.html][html]], [[file:handouts/lecture_notes/r_docs/rmarkdown_tutorial/rmarkdown_cheatsheet.pdf][pdf]], and [[file:handouts/lecture_notes/r_docs/rmarkdown_tutorial/rmarkdown_tutorial.Rmd][Rmd]])

** Lecture 7: Hypothesis Test and Confidence Intervals of Linear Regression with a Single Regressor
- Lecture notes ([[file:handouts/lecture_notes/lecture_7/lecture_7.html][html]] or [[file:handouts/lecture_notes/lecture_7/lecture_7.pdf][pdf]])
- The slides ([[file:handouts/lecture_notes/lecture_7/slides_lecture_7.html][html]] or [[file:handouts/lecture_notes/lecture_7/slides_lecture_7_beamer.pdf][pdf]])
- The R demonstration ([[file:handouts/lecture_notes/lecture_7/replication/replicate_ch5.html][html]] or [[file:handouts/lecture_notes/lecture_7/replication/replicate_ch5.pdf][pdf]])
- The R replication package ([[file:handouts/lecture_notes/lecture_7/replication/replicate_ch5.zip][zip]])

** Lecture 8: Linear Regression with Multiple Regressors
- Lecture notes ([[file:handouts/lecture_notes/lecture_8/lecture_8.pdf][pdf]])
- Slides ([[file:handouts/lecture_notes/lecture_8/slides_lecture_8.pdf][beamer]])
- R document ([[file:handouts/lecture_notes/lecture_8/replication/replicate_ch6.pdf][pdf]] and [[file:handouts/lecture_notes/lecture_8/replication.zip][zip]])
** Lecture 9: Hypothesis Tests and Confidence Intervals in Multiple Regression
- Lecture notes ([[file:handouts/lecture_notes/lecture_9/lecture_9.pdf][pdf]])
- Slides ([[file:handouts/lecture_notes/lecture_9/slides_lecture_9.pdf][beamer]])
- R documents  ([[file:handouts/lecture_notes/lecture_9/replication_ch7/replicate_ch7.pdf][pdf]], [[file:handouts/lecture_notes/lecture_9/replication_ch7.zip][zip]])
** Lecture 10: Nonlinear Regression Functions
- Lecture notes ([[file:handouts/lecture_notes/lecture_10/lecture_10.pdf][pdf]])
- Slides ([[file:handouts/lecture_notes/lecture_10/slides_lecture_10.pdf][beamer]])
- R documents ([[file:handouts/lecture_notes/lecture_10/replicate_ch8.zip][zip]])
** Lecture 11: Assessing Studies Based on Multiple Regression
- Lecture notes ([[file:handouts/lecture_notes/lecture_11/lecture_11.pdf][pdf]], incomplete)
- Slides ([[file:handouts/lecture_notes/lecture_11/slides_lecture_11.pdf][beamer]], incomplete)

** Final review
- The final review: ([[file:handouts/lecture_notes/finalreview/finalreview_2017.pdf][pdf]])


* Homework

** Homework set #1

- Homework set #1: [[file:assignment/homework/homework_1/homework_1.pdf][homework_1.pdf]].
- Answer: [[file:assignment/homework/homework_1/ans_hw_1.pdf][ans_hw_1.pdf]]

** Homework set #2

- Homework set #2: [[file:assignment/homework/homework_2/homework_2.pdf][homework_2.pdf]]. The data files are included in this
  zip file, [[file:assignment/homework/homework_2/TeachingRatings.zip][TeachingRatings.zip]].
- Answer: [[file:assignment/homework/homework_2/answers/ans_hw_2.pdf][pdf]].

** Homework set #3

- Homework set #3: [[file:assignment/homework/homework_3/homework_3.pdf][homework_3.pdf]]. The data file is the same as in
  Homework set #2.
- Answers to homework 3 ([[file:assignment/homework/homework_3/answers.zip][zip]])

** Homework set #4
- Homework set #4: [[file:assignment/homework/homework_4/homework_4.pdf][pdf]].
- Answer: [[file:assignment/homework/homework_4/answer.zip][zip]]

** Homework set #5
- Homework set #5: [[file:assignment/homework/homework_5/homework_5.pdf][pdf]]. Data file, [[file:assignment/homework/homework_5/data.zip][zip]].
