index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-14 Sun 22:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Econometrics 2017</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Zheng Tian" />
<link rel="stylesheet" type="text/css" href="css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Econometrics 2017</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8739bfa">1. Announcement</a>
<ul>
<li><a href="#org9ac1619"><span class="timestamp-wrapper"><span class="timestamp">[2017-05-14 Sun]</span></span></a></li>
<li><a href="#orgdafc8a2"><span class="timestamp-wrapper"><span class="timestamp">[2017-04-19 Wed]</span></span></a></li>
<li><a href="#org19f6bb3"><span class="timestamp-wrapper"><span class="timestamp">[2017-04-16 Sun]</span></span></a></li>
<li><a href="#orga5d7ec1"><span class="timestamp-wrapper"><span class="timestamp">[2017-04-10 Mon]</span></span></a></li>
<li><a href="#org882d2a4"><span class="timestamp-wrapper"><span class="timestamp">[2017-03-22 Wed]</span></span></a></li>
<li><a href="#org774caee"><span class="timestamp-wrapper"><span class="timestamp">[2017-03-20 Mon]</span></span></a></li>
<li><a href="#orgb0798b4"><span class="timestamp-wrapper"><span class="timestamp">[2017-03-06 Mon]</span></span></a></li>
</ul>
</li>
<li><a href="#orga32579a">2. Syllabus</a></li>
<li><a href="#org1f0b89e">3. Lecture notes</a>
<ul>
<li><a href="#org795c8f1">Lecture 1: What is Econometrics?</a></li>
<li><a href="#orgaabb523">Lecture 2: Review of Probability</a></li>
<li><a href="#org464fada">Lecture 3: Review of Statistics</a></li>
<li><a href="#org4f1d8e0">Lecture 4: Review of Linear Algebra</a></li>
<li><a href="#org6466d8f">Lecture 5: Introduction to R</a></li>
<li><a href="#org07c05c2">Lecture 6: Linear Regression with One Regressor</a></li>
<li><a href="#org87159e5">Lecture 7: Hypothesis Test and Confidence Intervals of Linear Regression with a Single Regressor</a></li>
<li><a href="#org04940ba">Lecture 8: Linear Regression with Multiple Regressors</a></li>
<li><a href="#orgdfff3c8">Lecture 9: Hypothesis Tests and Confidence Intervals in Multiple Regression</a></li>
<li><a href="#org0dbc4f9">Lecture 10: Nonlinear Regression Functions</a></li>
</ul>
</li>
<li><a href="#orgc817471">4. Homework</a>
<ul>
<li><a href="#org5d1f858">Homework set #1</a></li>
<li><a href="#org48e32e6">Homework set #2</a></li>
<li><a href="#org7f23e86">Homework set #3</a></li>
<li><a href="#org7f79c88">Homework set #4</a></li>
<li><a href="#org073d79f">Homework set #5</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This website contains the course materials for the course of
Econometrics offered at ISEM, CUEB, in the 2nd semester of the
2016-2017 academic year.
</p>

<div id="outline-container-org8739bfa" class="outline-2">
<h2 id="org8739bfa"><span class="section-number-2">1</span> Announcement</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org9ac1619" class="outline-3">
<h3 id="org9ac1619"><span class="timestamp-wrapper"><span class="timestamp">[2017-05-14 Sun]</span></span></h3>
<div class="outline-text-3" id="text-org9ac1619">
<p>
<a href="#org073d79f">Homework set #5</a> is assigned, which is due on May 22nd.
</p>
</div>
</div>

<div id="outline-container-orgdafc8a2" class="outline-3">
<h3 id="orgdafc8a2"><span class="timestamp-wrapper"><span class="timestamp">[2017-04-19 Wed]</span></span></h3>
<div class="outline-text-3" id="text-orgdafc8a2">
<p>
<a href="#org7f79c88">Homework set #4</a> is assigned, which is due on May 3rd.
</p>
</div>
</div>

<div id="outline-container-org19f6bb3" class="outline-3">
<h3 id="org19f6bb3"><span class="timestamp-wrapper"><span class="timestamp">[2017-04-16 Sun]</span></span></h3>
<div class="outline-text-3" id="text-org19f6bb3">
<p>
We will have a midterm exam on April 24th, Monday. The test will cover
all contents we have learned through lecture 1 to 8. A cheat sheet is
allowed to bring in the exam. The following is a sample midterm test
to help you prepare the midterm, <a href="assignment/midterm/A%20Sample%20Mid.pdf">a sample midterm</a>.
</p>
</div>
</div>


<div id="outline-container-orga5d7ec1" class="outline-3">
<h3 id="orga5d7ec1"><span class="timestamp-wrapper"><span class="timestamp">[2017-04-10 Mon]</span></span></h3>
<div class="outline-text-3" id="text-orga5d7ec1">
<ul class="org-ul">
<li><a href="#org7f23e86">Homework set #3</a> is assigned, due on <b>April 17th</b>.</li>
</ul>
</div>
</div>


<div id="outline-container-org882d2a4" class="outline-3">
<h3 id="org882d2a4"><span class="timestamp-wrapper"><span class="timestamp">[2017-03-22 Wed]</span></span></h3>
<div class="outline-text-3" id="text-org882d2a4">
<ul class="org-ul">
<li><a href="#org48e32e6">Homework set #2</a> is assigned, due on <b>April 5th</b>.</li>
</ul>
</div>
</div>


<div id="outline-container-org774caee" class="outline-3">
<h3 id="org774caee"><span class="timestamp-wrapper"><span class="timestamp">[2017-03-20 Mon]</span></span></h3>
<div class="outline-text-3" id="text-org774caee">
<p>
You can download the following files, <a href="handouts/lecture_notes/r_docs/Reference%20Card.pdf">Rreferencecard.pdf</a> and
<a href="handouts/lecture_notes/r_docs/r-cheat-sheet-3.pdf">Rcheatsheet.pdf</a>, which can help you quickly find relevant R commands.
</p>
</div>
</div>


<div id="outline-container-orgb0798b4" class="outline-3">
<h3 id="orgb0798b4"><span class="timestamp-wrapper"><span class="timestamp">[2017-03-06 Mon]</span></span></h3>
<div class="outline-text-3" id="text-orgb0798b4">
<ul class="org-ul">
<li>I create a survey, <a href="https://www.diaochapai.com/survey2500285">https://www.diaochapai.com/survey2500285</a>, to
inquire your understanding of probability and statistics and ask for
your suggestion to this course. Please complete the survey in your
spare time. Thanks!</li>

<li><a href="#org5d1f858">Homework set #1</a> is assigned, due on <b>March 13</b>.</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orga32579a" class="outline-2">
<h2 id="orga32579a"><span class="section-number-2">2</span> Syllabus</h2>
<div class="outline-text-2" id="text-2">
<p>
Read carefully the syllabus (<a href="handouts/syllabus/syllabus_econometrics_2017_web.html">html</a> or <a href="handouts/syllabus/syllabus_econometrics_2017.pdf">pdf</a>).
</p>
</div>
</div>


<div id="outline-container-org1f0b89e" class="outline-2">
<h2 id="org1f0b89e"><span class="section-number-2">3</span> Lecture notes</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org795c8f1" class="outline-3">
<h3 id="org795c8f1">Lecture 1: What is Econometrics?</h3>
<div class="outline-text-3" id="text-org795c8f1">
<ul class="org-ul">
<li>The lecture notes (<a href="handouts/lecture_notes/lecture_1/lecture_1.html">html</a> or <a href="handouts/lecture_notes/lecture_1/lecture_1.pdf">pdf</a>)</li>
<li>The slides (<a href="handouts/lecture_notes/lecture_1/slides_lecture_1.html">html</a> or <a href="handouts/lecture_notes/lecture_1/slides_lecture_1_beamer.pdf">pdf</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-orgaabb523" class="outline-3">
<h3 id="orgaabb523">Lecture 2: Review of Probability</h3>
<div class="outline-text-3" id="text-orgaabb523">
<ul class="org-ul">
<li>The lecture notes (<a href="handouts/lecture_notes/lecture_2/lecture_2.html">html</a> or <a href="handouts/lecture_notes/lecture_2/lecture_2.pdf">pdf</a>)</li>
<li>The slides (<a href="handouts/lecture_notes/lecture_2/slides_lecture_2.html">html</a> or <a href="handouts/lecture_notes/lecture_2/slides_lecture_2_bearmer.pdf">pdf</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org464fada" class="outline-3">
<h3 id="org464fada">Lecture 3: Review of Statistics</h3>
<div class="outline-text-3" id="text-org464fada">
<ul class="org-ul">
<li>The lecture notes (<a href="handouts/lecture_notes/lecture_3/lecture_3.html">html</a> or <a href="handouts/lecture_notes/lecture_3/lecture_3.pdf">pdf</a>)</li>
<li>The slides (<a href="handouts/lecture_notes/lecture_3/slide_lecture_3.html">html</a> or <a href="handouts/lecture_notes/lecture_3/slide_lecture_3_beamer.pdf">pdf</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org4f1d8e0" class="outline-3">
<h3 id="org4f1d8e0">Lecture 4: Review of Linear Algebra</h3>
<div class="outline-text-3" id="text-org4f1d8e0">
<ul class="org-ul">
<li>The lecture notes (<a href="handouts/lecture_notes/lecture_4/lecture_4.html">html</a> or <a href="handouts/lecture_notes/lecture_4/lecture_4.pdf">pdf</a>)</li>
<li>The slides (<a href="handouts/lecture_notes/lecture_4/slides_lecture_4.html">html</a> or <a href="handouts/lecture_notes/lecture_4/slides_lecture_4_beamer.pdf">pdf</a>)</li>
</ul>
</div>
</div>
<div id="outline-container-org6466d8f" class="outline-3">
<h3 id="org6466d8f">Lecture 5: Introduction to R</h3>
<div class="outline-text-3" id="text-org6466d8f">
<ul class="org-ul">
<li>The lecture notes (<a href="handouts/lecture_notes/lecture_5/lecture_5.html">html</a> or <a href="handouts/lecture_notes/lecture_5/lecture_5.pdf">pdf</a>)</li>
<li>The R file that contains all the code in the lecture notes (<a href="handouts/lecture_notes/lecture_5/lecture_5.R">R
file</a>).</li>
<li>The whole package that can generate a complete an answer to
Empirical exercise 3.1, <a href="handouts/lecture_notes/lecture_5/rfiles.zip">rfiles.zip</a>.</li>
<li>I also upload a file as a tutorial for Econometrics with R
(<a href="handouts/lecture_notes/lecture_5/Farnsworth-EconometricsInR.pdf">pdf</a>).</li>
</ul>
</div>
</div>

<div id="outline-container-org07c05c2" class="outline-3">
<h3 id="org07c05c2">Lecture 6: Linear Regression with One Regressor</h3>
<div class="outline-text-3" id="text-org07c05c2">
<ul class="org-ul">
<li>The lecture notes (<a href="handouts/lecture_notes/lecture_6/lecture_6.html">html</a> or <a href="handouts/lecture_notes/lecture_6/lecture_6.pdf">pdf</a>)</li>
<li>The slides (<a href="handouts/lecture_notes/lecture_6/slides_lecture_6.html">html</a> or <a href="handouts/lecture_notes/lecture_6/slides_lecture_6_beamer.pdf">pdf</a>)</li>
<li>The R demonstration (<a href="handouts/lecture_notes/lecture_6/replication/replicate_ch4.html">html</a> or <a href="handouts/lecture_notes/lecture_6/replication/replicate_ch4.pdf">pdf</a>)</li>
<li>The R replication package (<a href="handouts/lecture_notes/lecture_6/replication/replicate_ch4_rmd/replicate_ch4_rmd.zip">the zip file</a>)</li>
<li>The R Markdown tutorial (<a href="handouts/lecture_notes/r_docs/rmarkdown_tutorial/rmarkdown_tutorial.html">html</a>, <a href="handouts/lecture_notes/r_docs/rmarkdown_tutorial/rmarkdown_cheatsheet.pdf">pdf</a>, and <a href="handouts/lecture_notes/r_docs/rmarkdown_tutorial/rmarkdown_tutorial.Rmd">Rmd</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org87159e5" class="outline-3">
<h3 id="org87159e5">Lecture 7: Hypothesis Test and Confidence Intervals of Linear Regression with a Single Regressor</h3>
<div class="outline-text-3" id="text-org87159e5">
<ul class="org-ul">
<li>Lecture notes (<a href="handouts/lecture_notes/lecture_7/lecture_7.html">html</a> or <a href="handouts/lecture_notes/lecture_7/lecture_7.pdf">pdf</a>)</li>
<li>The slides (<a href="handouts/lecture_notes/lecture_7/slides_lecture_7.html">html</a> or <a href="handouts/lecture_notes/lecture_7/slides_lecture_7_beamer.pdf">pdf</a>)</li>
<li>The R demonstration (<a href="handouts/lecture_notes/lecture_7/replication/replicate_ch5.html">html</a> or <a href="handouts/lecture_notes/lecture_7/replication/replicate_ch5.pdf">pdf</a>)</li>
<li>The R replication package (<a href="handouts/lecture_notes/lecture_7/replication/replicate_ch5.zip">zip</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org04940ba" class="outline-3">
<h3 id="org04940ba">Lecture 8: Linear Regression with Multiple Regressors</h3>
<div class="outline-text-3" id="text-org04940ba">
<ul class="org-ul">
<li>Lecture notes (<a href="handouts/lecture_notes/lecture_8/lecture_8.pdf">pdf</a>)</li>
<li>Slides (<a href="handouts/lecture_notes/lecture_8/slides_lecture_8.pdf">beamer</a>)</li>
<li>R document (<a href="handouts/lecture_notes/lecture_8/replication/replicate_ch6.pdf">pdf</a> and <a href="handouts/lecture_notes/lecture_8/replication.zip">zip</a>)</li>
</ul>
</div>
</div>
<div id="outline-container-orgdfff3c8" class="outline-3">
<h3 id="orgdfff3c8">Lecture 9: Hypothesis Tests and Confidence Intervals in Multiple Regression</h3>
<div class="outline-text-3" id="text-orgdfff3c8">
<ul class="org-ul">
<li>Lecture notes (<a href="handouts/lecture_notes/lecture_9/lecture_9.pdf">pdf</a>)</li>
<li>Slides (<a href="handouts/lecture_notes/lecture_9/slides_lecture_9.pdf">beamer</a>)</li>
<li>R documents  (<a href="handouts/lecture_notes/lecture_9/replication_ch7/replicate_ch7.pdf">pdf</a>, <a href="handouts/lecture_notes/lecture_9/replication_ch7.zip">zip</a>)</li>
</ul>
</div>
</div>
<div id="outline-container-org0dbc4f9" class="outline-3">
<h3 id="org0dbc4f9">Lecture 10: Nonlinear Regression Functions</h3>
<div class="outline-text-3" id="text-org0dbc4f9">
<ul class="org-ul">
<li>Lecture notes (<a href="handouts/lecture_notes/lecture_10/lecture_10.pdf">pdf</a>, incomplete)</li>
<li>Slides (<a href="handouts/lecture_notes/lecture_10/slides_lecture_10.pdf">pdf</a>, incomplete)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc817471" class="outline-2">
<h2 id="orgc817471"><span class="section-number-2">4</span> Homework</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org5d1f858" class="outline-3">
<h3 id="org5d1f858">Homework set #1</h3>
<div class="outline-text-3" id="text-org5d1f858">
<ul class="org-ul">
<li>Homework set #1: <a href="assignment/homework/homework_1/homework_1.pdf">homework_1.pdf</a>.</li>
<li>Answer: <a href="assignment/homework/homework_1/ans_hw_1.pdf">ans_hw_1.pdf</a></li>
</ul>
</div>
</div>

<div id="outline-container-org48e32e6" class="outline-3">
<h3 id="org48e32e6">Homework set #2</h3>
<div class="outline-text-3" id="text-org48e32e6">
<ul class="org-ul">
<li>Homework set #2: <a href="assignment/homework/homework_2/homework_2.pdf">homework_2.pdf</a>. The data files are included in this
zip file, <a href="assignment/homework/homework_2/TeachingRatings.zip">TeachingRatings.zip</a>.</li>
<li>Answer: <a href="assignment/homework/homework_2/answers/ans_hw_2.pdf">pdf</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org7f23e86" class="outline-3">
<h3 id="org7f23e86">Homework set #3</h3>
<div class="outline-text-3" id="text-org7f23e86">
<ul class="org-ul">
<li>Homework set #3: <a href="assignment/homework/homework_3/homework_3.pdf">homework_3.pdf</a>. The data file is the same as in
Homework set #2.</li>
<li>Answers to homework 3 (<a href="assignment/homework/homework_3/answers.zip">zip</a>)</li>
</ul>
</div>
</div>

<div id="outline-container-org7f79c88" class="outline-3">
<h3 id="org7f79c88">Homework set #4</h3>
<div class="outline-text-3" id="text-org7f79c88">
<ul class="org-ul">
<li>Homework set #4: <a href="assignment/homework/homework_4/homework_4.pdf">pdf</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org073d79f" class="outline-3">
<h3 id="org073d79f">Homework set #5</h3>
<div class="outline-text-3" id="text-org073d79f">
<ul class="org-ul">
<li>Homework set #5: <a href="assignment/homework/homework_5/homework_5.pdf">pdf</a>. Data file, <a href="assignment/homework/homework_5/data.zip">zip</a>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zheng Tian</p>
<p class="date">Created: 2017-05-14 Sun 22:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
